witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
	LCDDriver_printText(TRX.LOCATOR, 10, 37, COLOR_GREEN, BG_COLOR, LAYOUT->SYSMENU_FONT_SIZE);
	LCDDriver_drawFastHLine(8 + sysmenu_trx_selected_locator_char_index * 12, 54, 12, COLOR_RED);
}

static void SYSMENU_TRX_RotateCallsignChar(int8_t dir)
{
	bool full_redraw = false;
	if (TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] == 0)
		full_redraw = true;
	TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] += dir;

	// do not show special characters
	if (TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] >= 1 && TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] <= 32 && dir > 0)
		TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] = 33;
	if (TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] >= 1 && TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] <= 32 && dir < 0)
		TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] = 0;
	if (TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] >= 127)
		TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] = 0;
	if (TRX.CALLSIGN[sysmenu_trx_selected_callsign_char_index] == 0)
		full_redraw = true;

	if (full_redraw)
		LCD_UpdateQuery.SystemMenuRedraw = true;
	else
		LCD_UpdateQuery.SystemMenu = true;
}

static void SYSMENU_TRX_RotateLocatorChar(int8_t dir)
{
	bool full_redraw = false;
	if (TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] == 0)
		full_redraw = true;
	TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] += dir;

	// do not show special characters
	if (TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] >= 1 && TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] <= 32 && dir > 0)
		TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] = 33;
	if (TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] >= 1 && TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] <= 32 && dir < 0)
		TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] = 0;
	if (TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] >= 127)
		TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] = 0;
	if (TRX.LOCATOR[sysmenu_trx_selected_locator_char_index] == 0)
		full_redraw = true;

	if (full_redraw)
		LCD_UpdateQuery.SystemMenuRedraw = true;
	else
		LCD_UpdateQuery.SystemMenu = true;
}

static void SYSMENU_HANDL_TRX_SetCallsign(int8_t direction)
{
#pragma unused(direction)
	sysmenu_trx_setCallsign_menu_opened = true;
	SYSMENU_TRX_DrawCallsignMenu(true);
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_TRX_SetLocator(int8_t direction)
{
#pragma unused(direction)
	sysmenu_trx_setLocator_menu_opened = true;
	SYSMENU_TRX_DrawLocatorMenu(true);
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_TRX_TRANSV_ENABLE(int8_t direction)
{
	if (direction > 0)
		TRX.Transverter_Enabled = true;
	if (direction < 0)
		TRX.Transverter_Enabled = false;
}

static void SYSMENU_HANDL_TRX_TRANSV_OFFSET(int8_t direction)
{
	TRX.Transverter_Offset_Mhz += direction;
	if (TRX.Transverter_Offset_Mhz < 1)
		TRX.Transverter_Offset_Mhz = 1;
	if (TRX.Transverter_Offset_Mhz > 15000)
		TRX.Transverter_Offset_Mhz = 15000;
}

static void SYSMENU_HANDL_TRX_ATU_I(int8_t direction)
{
	if(CALIBRATE.RF_unit_type == RF_UNIT_BIG)
	{
		static const uint8_t MAX_ATU_POS = B8(00011111); //5x5 tuner
		if(TRX.ATU_I > 0 || direction > 0)
			TRX.ATU_I += direction;
		if (TRX.ATU_I > MAX_ATU_POS)
			TRX.ATU_I = MAX_ATU_POS;
	}
}

static void SYSMENU_HANDL_TRX_ATU_C(int8_t direction)
{
	if(CALIBRATE.RF_unit_type == RF_UNIT_BIG)
	{
		static const uint8_t MAX_ATU_POS = B8(00011111); //5x5 tuner
		if(TRX.ATU_C > 0 || direction > 0)
			TRX.ATU_C += direction;
		if (TRX.ATU_C > MAX_ATU_POS)
			TRX.ATU_C = MAX_ATU_POS;
	}
}

static void SYSMENU_HANDL_TRX_ATU_T(int8_t direction)
{
	if(CALIBRATE.RF_unit_type == RF_UNIT_BIG)
	{
		if (direction > 0)
			TRX.ATU_T = true;
		if (direction < 0)
			TRX.ATU_T = false;
	}
}

static void SYSMENU_HANDL_TRX_ATU_Enabled(int8_t direction)
{
	if(CALIBRATE.RF_unit_type == RF_UNIT_BIG)
	{
		if (direction > 0)
			TRX.ATU_Enabled = true;
		if (direction < 0)
			TRX.ATU_Enabled = false;
	}
}

//AUDIO MENU

static void SYSMENU_HANDL_AUDIOMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_audio_handlers[0];
	sysmenu_item_count = sizeof(sysmenu_audio_handlers) / sizeof(sysmenu_audio_handlers[0]);
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

void SYSMENU_AUDIO_BW_SSB_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	systemMenuIndex = 8;
	LCD_redraw(false);
}

void SYSMENU_AUDIO_BW_CW_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	systemMenuIndex = 11;
	LCD_redraw(false);
}

void SYSMENU_AUDIO_BW_AM_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	systemMenuIndex = 12;
	LCD_redraw(false);
}

void SYSMENU_AUDIO_BW_FM_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	systemMenuIndex = 14;
	LCD_redraw(false);
}

void SYSMENU_AUDIO_HPF_SSB_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	systemMenuIndex = 7;
	LCD_redraw(false);
}

void SYSMENU_AUDIO_SQUELCH_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	systemMenuIndex = 16;
	LCD_redraw(false);
}

void SYSMENU_AUDIO_AGC_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	systemMenuIndex = 25;
	LCD_redraw(false);
}

static void SYSMENU_HANDL_AUDIO_Volume(int8_t direction)
{
	if(direction > 0 || TRX.Volume > 0)
		TRX.Volume += direction;
	if (TRX.Volume > 100)
		TRX.Volume = 100;
}

static void SYSMENU_HANDL_AUDIO_DNR(int8_t direction)
{
	if (direction > 0 || CurrentVFO->DNR_Type > 0)
		CurrentVFO->DNR_Type += direction;
	if (CurrentVFO->DNR_Type > 2)
		CurrentVFO->DNR_Type = 2;
	
	TRX.DNR_shadow = CurrentVFO->DNR_Type;
	
	int8_t band = getBandFromFreq(CurrentVFO->Freq, true);
	if (band > 0)
		TRX.BANDS_SAVED_SETTINGS[band].DNR_Type = CurrentVFO->DNR_Type;
}

static void SYSMENU_HANDL_AUDIO_AGC(int8_t direction)
{
	if (direction > 0)
		CurrentVFO->AGC = true;
	if (direction < 0)
		CurrentVFO->AGC = false;
	
	TRX.AGC_shadow = CurrentVFO->AGC;
	
	int8_t band = getBandFromFreq(CurrentVFO->Freq, true);
	if (band > 0)
		TRX.BANDS_SAVED_SETTINGS[band].AGC = CurrentVFO->AGC;
}

static void SYSMENU_HANDL_AUDIO_NOISE_BLANKER(int8_t direction)
{
	if (direction > 0)
		TRX.NOISE_BLANKER = true;
	if (direction < 0)
		TRX.NOISE_BLANKER = false;
}

static void SYSMENU_HANDL_AUDIO_IFGain(int8_t direction)
{
	TRX.IF_Gain += direction;
	if (TRX.IF_Gain < 1)
		TRX.IF_Gain = 1;
	if (TRX.IF_Gain > 80)
		TRX.IF_Gain = 80;
}

static void SYSMENU_HANDL_AUDIO_AGC_GAIN_TARGET(int8_t direction)
{
	TRX.AGC_GAIN_TARGET += direction;
	if (TRX.AGC_GAIN_TARGET < -80)
		TRX.AGC_GAIN_TARGET = -80;
	if (TRX.AGC_GAIN_TARGET > -10)
		TRX.AGC_GAIN_TARGET = -10;
}

static void SYSMENU_HANDL_AUDIO_MIC_Gain(int8_t direction)
{
	TRX.MIC_GAIN += direction;
	if (TRX.MIC_GAIN < 1)
		TRX.MIC_GAIN = 1;
	if (TRX.MIC_GAIN > 20)
		TRX.MIC_GAIN = 20;
}

static void SYSMENU_HANDL_AUDIO_MIC_Boost(int8_t direction)
{
	if (direction < 0)
		TRX.MIC_Boost = false;
	if (direction > 0)
		TRX.MIC_Boost = true;
	
	//reinit codec
	WM8731_TXRX_mode();
}

