witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_AUDIO_DNR1_THRES(int8_t direction)
{
	TRX.DNR1_SNR_THRESHOLD += direction;
	if (TRX.DNR1_SNR_THRESHOLD < 1)
		TRX.DNR1_SNR_THRESHOLD = 1;
	if (TRX.DNR1_SNR_THRESHOLD > 100)
		TRX.DNR1_SNR_THRESHOLD = 100;
}

static void SYSMENU_HANDL_AUDIO_DNR2_THRES(int8_t direction)
{
	TRX.DNR2_SNR_THRESHOLD += direction;
	if (TRX.DNR2_SNR_THRESHOLD < 1)
		TRX.DNR2_SNR_THRESHOLD = 1;
	if (TRX.DNR2_SNR_THRESHOLD > 100)
		TRX.DNR2_SNR_THRESHOLD = 100;
}

static void SYSMENU_HANDL_AUDIO_DNR_AVERAGE(int8_t direction)
{
	TRX.DNR_AVERAGE += direction;
	if (TRX.DNR_AVERAGE < 1)
		TRX.DNR_AVERAGE = 1;
	if (TRX.DNR_AVERAGE > 100)
		TRX.DNR_AVERAGE = 100;
}

static void SYSMENU_HANDL_AUDIO_DNR_MINMAL(int8_t direction)
{
	TRX.DNR_MINIMAL += direction;
	if (TRX.DNR_MINIMAL < 1)
		TRX.DNR_MINIMAL = 1;
	if (TRX.DNR_MINIMAL > 100)
		TRX.DNR_MINIMAL = 100;
}

static void SYSMENU_HANDL_AUDIO_MIC_EQ_LOW_SSB(int8_t direction)
{
	TRX.MIC_EQ_LOW_SSB += direction;
	if (TRX.MIC_EQ_LOW_SSB < -10)
		TRX.MIC_EQ_LOW_SSB = -10;
	if (TRX.MIC_EQ_LOW_SSB > 10)
		TRX.MIC_EQ_LOW_SSB = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_EQ_LOW_AMFM(int8_t direction)
{
	TRX.MIC_EQ_LOW_AMFM += direction;
	if (TRX.MIC_EQ_LOW_AMFM < -10)
		TRX.MIC_EQ_LOW_AMFM = -10;
	if (TRX.MIC_EQ_LOW_AMFM > 10)
		TRX.MIC_EQ_LOW_AMFM = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_EQ_MID_SSB(int8_t direction)
{
	TRX.MIC_EQ_MID_SSB += direction;
	if (TRX.MIC_EQ_MID_SSB < -10)
		TRX.MIC_EQ_MID_SSB = -10;
	if (TRX.MIC_EQ_MID_SSB > 10)
		TRX.MIC_EQ_MID_SSB = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_EQ_MID_AMFM(int8_t direction)
{
	TRX.MIC_EQ_MID_AMFM += direction;
	if (TRX.MIC_EQ_MID_AMFM < -10)
		TRX.MIC_EQ_MID_AMFM = -10;
	if (TRX.MIC_EQ_MID_AMFM > 10)
		TRX.MIC_EQ_MID_AMFM = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_EQ_HIG_SSB(int8_t direction)
{
	TRX.MIC_EQ_HIG_SSB += direction;
	if (TRX.MIC_EQ_HIG_SSB < -10)
		TRX.MIC_EQ_HIG_SSB = -10;
	if (TRX.MIC_EQ_HIG_SSB > 10)
		TRX.MIC_EQ_HIG_SSB = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_EQ_HIG_AMFM(int8_t direction)
{
	TRX.MIC_EQ_HIG_AMFM += direction;
	if (TRX.MIC_EQ_HIG_AMFM < -10)
		TRX.MIC_EQ_HIG_AMFM = -10;
	if (TRX.MIC_EQ_HIG_AMFM > 10)
		TRX.MIC_EQ_HIG_AMFM = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_REVERBER(int8_t direction)
{
	if (direction > 0 || TRX.MIC_REVERBER > 0)
		TRX.MIC_REVERBER += direction;
	if (TRX.MIC_REVERBER > (AUDIO_MAX_REVERBER_TAPS - 1))
		TRX.MIC_REVERBER = (AUDIO_MAX_REVERBER_TAPS - 1);
	NeedReinitReverber = true;
}

static void SYSMENU_HANDL_AUDIO_RX_EQ_LOW(int8_t direction)
{
	TRX.RX_EQ_LOW += direction;
	if (TRX.RX_EQ_LOW < -10)
		TRX.RX_EQ_LOW = -10;
	if (TRX.RX_EQ_LOW > 10)
		TRX.RX_EQ_LOW = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_RX_EQ_MID(int8_t direction)
{
	TRX.RX_EQ_MID += direction;
	if (TRX.RX_EQ_MID < -10)
		TRX.RX_EQ_MID = -10;
	if (TRX.RX_EQ_MID > 10)
		TRX.RX_EQ_MID = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_RX_EQ_HIG(int8_t direction)
{
	TRX.RX_EQ_HIG += direction;
	if (TRX.RX_EQ_HIG < -10)
		TRX.RX_EQ_HIG = -10;
	if (TRX.RX_EQ_HIG > 10)
		TRX.RX_EQ_HIG = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_RX_AGC_SSB_Speed(int8_t direction)
{
	TRX.RX_AGC_SSB_speed += direction;
	if (TRX.RX_AGC_SSB_speed < 1)
		TRX.RX_AGC_SSB_speed = 1;
	if (TRX.RX_AGC_SSB_speed > 20)
		TRX.RX_AGC_SSB_speed = 20;
}

static void SYSMENU_HANDL_AUDIO_RX_AGC_CW_Speed(int8_t direction)
{
	TRX.RX_AGC_CW_speed += direction;
	if (TRX.RX_AGC_CW_speed < 1)
		TRX.RX_AGC_CW_speed = 1;
	if (TRX.RX_AGC_CW_speed > 20)
		TRX.RX_AGC_CW_speed = 20;
}

static void SYSMENU_HANDL_AUDIO_RX_AGC_Max_gain(int8_t direction)
{
	TRX.RX_AGC_Max_gain += direction;
	if (TRX.RX_AGC_Max_gain < 1)
		TRX.RX_AGC_Max_gain = 1;
	if (TRX.RX_AGC_Max_gain > 50)
		TRX.RX_AGC_Max_gain = 50;
}

static void SYSMENU_HANDL_AUDIO_RX_AGC_Hold(int8_t direction)
{
	if(TRX.RX_AGC_Hold > 0 || direction > 0)
		TRX.RX_AGC_Hold += direction * 100;
	if (TRX.RX_AGC_Hold > 5000)
		TRX.RX_AGC_Hold = 5000;
}

static void SYSMENU_HANDL_AUDIO_TX_CompressorSpeed_SSB(int8_t direction)
{
	TRX.TX_Compressor_speed_SSB += direction;
	if (TRX.TX_Compressor_speed_SSB < 1)
		TRX.TX_Compressor_speed_SSB = 1;
	if (TRX.TX_Compressor_speed_SSB > 200)
		TRX.TX_Compressor_speed_SSB = 200;
}

static void SYSMENU_HANDL_AUDIO_TX_CompressorSpeed_AMFM(int8_t direction)
{
	TRX.TX_Compressor_speed_AMFM += direction;
	if (TRX.TX_Compressor_speed_AMFM < 1)
		TRX.TX_Compressor_speed_AMFM = 1;
	if (TRX.TX_Compressor_speed_AMFM > 200)
		TRX.TX_Compressor_speed_AMFM = 200;
}

static void SYSMENU_HANDL_AUDIO_TX_CompressorMaxGain_SSB(int8_t direction)
{
	TRX.TX_Compressor_maxgain_SSB += direction;
	if (TRX.TX_Compressor_maxgain_SSB < 1)
		TRX.TX_Compressor_maxgain_SSB = 1;
	if (TRX.TX_Compressor_maxgain_SSB > 30)
		TRX.TX_Compressor_maxgain_SSB = 30;
}

static void SYSMENU_HANDL_AUDIO_TX_CompressorMaxGain_AMFM(int8_t direction)
{
	TRX.TX_Compressor_maxgain_AMFM += direction;
	if (TRX.TX_Compressor_maxgain_AMFM < 1)
		TRX.TX_Compressor_maxgain_AMFM = 1;
	if (TRX.TX_Compressor_maxgain_AMFM > 30)
		TRX.TX_Compressor_maxgain_AMFM = 30;
}

static void SYSMENU_HANDL_AUDIO_FMSquelch(int8_t direction)
{
	CurrentVFO->FM_SQL_threshold_dbm += direction;
	TRX.FM_SQL_threshold_dbm_shadow = CurrentVFO->FM_SQL_threshold_dbm;

	int8_t band = getBandFromFreq(CurrentVFO->Freq, true);
	if (band >= 0)
		TRX.BANDS_SAVED_SETTINGS[band].FM_SQL_threshold_dbm = CurrentVFO->FM_SQL_threshold_dbm;
}

static void SYSMENU_HANDL_AUDIO_Squelch(int8_t direction)
{
	if (direction > 0)
		CurrentVFO->SQL = true;
	if (direction < 0)
		CurrentVFO->SQL = false;
	TRX.SQL_shadow = CurrentVFO->SQL;
	
	int8_t band = getBandFromFreq(CurrentVFO->Freq, true);
	if (band >= 0)
		TRX.BANDS_SAVED_SETTINGS[band].SQL = CurrentVFO->SQL;
}

static void SYSMENU_HANDL_AUDIO_SSB_HPF_pass(int8_t direction)
{
	if (TRX.SSB_HPF_Filter > 0 || direction > 0)
		TRX.SSB_HPF_Filter += direction * 50;
	if(TRX.SSB_HPF_Filter > MAX_HPF_WIDTH)
		TRX.SSB_HPF_Filter = MAX_HPF_WIDTH;
	
	TRX_setMode(SecondaryVFO->Mode, SecondaryVFO);
	TRX_setMode(CurrentVFO->Mode, CurrentVFO);
}

static void SYSMENU_HANDL_AUDIO_CW_LPF_pass(int8_t direction)
{
	if (TRX.CW_LPF_Filter > 50 || direction > 0)
		TRX.CW_LPF_Filter += direction * 50;
	if(TRX.CW_LPF_Filter > MAX_LPF_WIDTH_CW)
		TRX.CW_LPF_Filter = MAX_LPF_WIDTH_CW;

	TRX_setMode(SecondaryVFO->Mode, SecondaryVFO);
	TRX_setMode(CurrentVFO->Mode, CurrentVFO);
}

static void SYSMENU_HANDL_AUDIO_SSB_LPF_RX_pass(int8_t direction)
{
	if (TRX.SSB_LPF_RX_Filter > 100 || direction > 0)
		TRX.SSB_LPF_RX_Filter += direction * 100;
	if(TRX.SSB_LPF_RX_Filter > MAX_LPF_WIDTH_SSB)
		TRX.SSB_LPF_RX_Filter = MAX_LPF_WIDTH_SSB;

	TRX_setMode(SecondaryVFO->Mode, SecondaryVFO);
	TRX_setMode(CurrentVFO->Mode, CurrentVFO);
}

static void SYSMENU_HANDL_AUDIO_SSB_LPF_TX_pass(int8_t direction)
{
	if (TRX.SSB_LPF_TX_Filter > 100 || direction > 0)
		TRX.SSB_LPF_TX_Filter += direction * 100;
	if(TRX.SSB_LPF_TX_Filter > MAX_LPF_WIDTH_SSB)
		TRX.SSB_LPF_TX_Filter = MAX_LPF_WIDTH_SSB;

	TRX_setMode(SecondaryVFO->Mode, SecondaryVFO);
	TRX_setMode(CurrentVFO->Mode, CurrentVFO);
}

