witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON22(int8_t direction)
{
	if (TRX.FuncButtons[21] > 0 || direction > 0)
		TRX.FuncButtons[21] += direction;
	if (TRX.FuncButtons[21] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[21] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON23(int8_t direction)
{
	if (TRX.FuncButtons[22] > 0 || direction > 0)
		TRX.FuncButtons[22] += direction;
	if (TRX.FuncButtons[22] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[22] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON24(int8_t direction)
{
	if (TRX.FuncButtons[23] > 0 || direction > 0)
		TRX.FuncButtons[23] += direction;
	if (TRX.FuncButtons[23] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[23] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON25(int8_t direction)
{
	if (TRX.FuncButtons[24] > 0 || direction > 0)
		TRX.FuncButtons[24] += direction;
	if (TRX.FuncButtons[24] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[24] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON26(int8_t direction)
{
	if (TRX.FuncButtons[25] > 0 || direction > 0)
		TRX.FuncButtons[25] += direction;
	if (TRX.FuncButtons[25] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[25] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON27(int8_t direction)
{
	if (TRX.FuncButtons[26] > 0 || direction > 0)
		TRX.FuncButtons[26] += direction;
	if (TRX.FuncButtons[26] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[26] = FUNCBUTTONS_COUNT - 1;
}
#endif

#if FUNCBUTTONS_COUNT > 27
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON28(int8_t direction)
{
	if (TRX.FuncButtons[27] > 0 || direction > 0)
		TRX.FuncButtons[27] += direction;
	if (TRX.FuncButtons[27] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[27] = FUNCBUTTONS_COUNT - 1;
}
#endif

#if FUNCBUTTONS_COUNT > 28
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON29(int8_t direction)
{
	if (TRX.FuncButtons[28] > 0 || direction > 0)
		TRX.FuncButtons[28] += direction;
	if (TRX.FuncButtons[28] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[28] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON30(int8_t direction)
{
	if (TRX.FuncButtons[29] > 0 || direction > 0)
		TRX.FuncButtons[29] += direction;
	if (TRX.FuncButtons[29] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[29] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON31(int8_t direction)
{
	if (TRX.FuncButtons[30] > 0 || direction > 0)
		TRX.FuncButtons[30] += direction;
	if (TRX.FuncButtons[30] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[30] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON32(int8_t direction)
{
	if (TRX.FuncButtons[31] > 0 || direction > 0)
		TRX.FuncButtons[31] += direction;
	if (TRX.FuncButtons[31] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[31] = FUNCBUTTONS_COUNT - 1;
}
#endif 

//DECODERS MENU

static void SYSMENU_HANDL_DECODERSMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_decoders_handlers[0];
	sysmenu_item_count = sizeof(sysmenu_decoders_handlers) / sizeof(sysmenu_decoders_handlers[0]);
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_redraw(false);
}

static void SYSMENU_HANDL_DECODERS_CW_Decoder(int8_t direction)
{
	if (direction > 0)
		TRX.CW_Decoder = true;
	if (direction < 0)
		TRX.CW_Decoder = false;
}

static void SYSMENU_HANDL_DECODERS_RDS_Decoder(int8_t direction)
{
	if (direction > 0)
		TRX.RDS_Decoder = true;
	if (direction < 0)
		TRX.RDS_Decoder = false;
}

static void SYSMENU_HANDL_DECODERS_RTTY_Speed(int8_t direction)
{
	if (direction > 0)
	{
		if(TRX.RTTY_Speed == 45)
			TRX.RTTY_Speed = 50;
		else if(TRX.RTTY_Speed == 50)
			TRX.RTTY_Speed = 75;
		else if(TRX.RTTY_Speed == 75)
			TRX.RTTY_Speed = 100;
		else if(TRX.RTTY_Speed == 100)
			TRX.RTTY_Speed = 150;
		else if(TRX.RTTY_Speed == 150)
			TRX.RTTY_Speed = 300;
	}
	if (direction < 0)
	{
		if(TRX.RTTY_Speed == 300)
			TRX.RTTY_Speed = 150;
		else if(TRX.RTTY_Speed == 150)
			TRX.RTTY_Speed = 100;
		else if(TRX.RTTY_Speed == 100)
			TRX.RTTY_Speed = 75;
		else if(TRX.RTTY_Speed == 75)
			TRX.RTTY_Speed = 50;
		else if(TRX.RTTY_Speed == 50)
			TRX.RTTY_Speed = 45;
	}
	
	RTTYDecoder_Init();
}

static void SYSMENU_HANDL_DECODERS_RTTY_Shift(int8_t direction)
{
	if (direction > 0)
	{
		if(TRX.RTTY_Shift == 85)
			TRX.RTTY_Shift = 170;
		else if(TRX.RTTY_Shift == 170)
			TRX.RTTY_Shift = 182;
		else if(TRX.RTTY_Shift == 182)
			TRX.RTTY_Shift = 200;
		else if(TRX.RTTY_Shift == 200)
			TRX.RTTY_Shift = 220;
		else if(TRX.RTTY_Shift == 220)
			TRX.RTTY_Shift = 240;
		else if(TRX.RTTY_Shift == 240)
			TRX.RTTY_Shift = 350;
		else if(TRX.RTTY_Shift == 350)
			TRX.RTTY_Shift = 425;
		else if(TRX.RTTY_Shift == 425)
			TRX.RTTY_Shift = 450;
		else if(TRX.RTTY_Shift == 450)
			TRX.RTTY_Shift = 850;
	}
	if (direction < 0)
	{
		if(TRX.RTTY_Shift == 850)
			TRX.RTTY_Shift = 450;
		else if(TRX.RTTY_Shift == 450)
			TRX.RTTY_Shift = 425;
		else if(TRX.RTTY_Shift == 425)
			TRX.RTTY_Shift = 350;
		else if(TRX.RTTY_Shift == 350)
			TRX.RTTY_Shift = 240;
		else if(TRX.RTTY_Shift == 240)
			TRX.RTTY_Shift = 220;
		else if(TRX.RTTY_Shift == 220)
			TRX.RTTY_Shift = 200;
		else if(TRX.RTTY_Shift == 200)
			TRX.RTTY_Shift = 182;
		else if(TRX.RTTY_Shift == 182)
			TRX.RTTY_Shift = 170;
		else if(TRX.RTTY_Shift == 170)
			TRX.RTTY_Shift = 85;
	}
	
	RTTYDecoder_Init();
}

static void SYSMENU_HANDL_DECODERS_RTTY_Freq(int8_t direction)
{
	if (TRX.RTTY_Freq > 50 || direction > 0)
		TRX.RTTY_Freq += direction * 50;
	if (TRX.RTTY_Freq > 3000)
		TRX.RTTY_Freq = 3000;
	
	RTTYDecoder_Init();
}

static void SYSMENU_HANDL_DECODERS_RTTY_StopBits(int8_t direction)
{
	if (TRX.RTTY_StopBits > 0 || direction > 0)
		TRX.RTTY_StopBits += direction;
	if (TRX.RTTY_StopBits > 2)
		TRX.RTTY_StopBits = 2;
	
	RTTYDecoder_Init();
}

//ADC/DAC MENU

static void SYSMENU_HANDL_ADCMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_adc_handlers[0];
	sysmenu_item_count = sizeof(sysmenu_adc_handlers) / sizeof(sysmenu_adc_handlers[0]);
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

