witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_WIFI_CAT_Server(int8_t direction)
{
	if (direction > 0)
		TRX.WIFI_CAT_SERVER = true;
	if (direction < 0)
		TRX.WIFI_CAT_SERVER = false;
}

static void SYSMENU_HANDL_WIFI_UpdateFW(int8_t direction)
{
#pragma unused(direction)
	LCD_systemMenuOpened = false;
	LCD_redraw(false);
	LCD_doEvents();
	WIFI_UpdateFW(NULL);
	LCD_showTooltip("Started, see console");
}

//SD MENU

static void SYSMENU_HANDL_SDMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_sd_handlers[0];
	sysmenu_item_count = sizeof(sysmenu_sd_handlers) / sizeof(sysmenu_sd_handlers[0]);
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_SD_USB(int8_t direction)
{
	if (direction > 0 && SD_isIdle() && !LCD_busy)
	{
		TRX_Mute = true;
		SD_USBCardReader = true;
		USBD_Restart();
	}
	else
	{
		SD_USBCardReader = false;
		USBD_Restart();
		TRX_Mute = false;
	}
}

static void SYSMENU_HANDL_SD_ExportSettings(int8_t direction)
{
	if (direction > 0 && SD_isIdle() && !LCD_busy)
	{
		SD_doCommand(SDCOMM_EXPORT_SETTINGS, false);
	}
}

static void SYSMENU_HANDL_SD_ImportSettings(int8_t direction)
{
	if (direction > 0 && SD_isIdle() && !LCD_busy)
	{
		SD_doCommand(SDCOMM_IMPORT_SETTINGS, false);
		NeedSaveCalibration = true;
	}
}

static void SYSMENU_HANDL_SD_Format(int8_t direction)
{
	if (direction > 0 && SD_isIdle() && !LCD_busy)
	{
		SD_doCommand(SDCOMM_FORMAT, false);
	}
}

//SET TIME MENU

static void SYSMENU_HANDL_SETTIME(int8_t direction)
{
	if (!sysmenu_timeMenuOpened)
		LCDDriver_Fill(BG_COLOR);
	sysmenu_timeMenuOpened = true;
	static uint8_t Hours;
	static uint8_t Minutes;
	static uint8_t Seconds;
	static uint32_t Time;
	char ctmp[50];
	Time = RTC->TR;
	Hours = ((Time >> 20) & 0x03) * 10 + ((Time >> 16) & 0x0f);
	Minutes = ((Time >> 12) & 0x07) * 10 + ((Time >> 8) & 0x0f);
	Seconds = ((Time >> 4) & 0x07) * 10 + ((Time >> 0) & 0x0f);
	if (direction != 0)
	{
		if (TimeMenuSelection == 0)
		{
			if (Hours == 0 && direction < 0)
			{
				LCD_UpdateQuery.SystemMenuRedraw = true;
				return;
			}
			Hours = (uint8_t)(Hours + direction);
		}
		if (TimeMenuSelection == 1)
		{
			if (Minutes == 0 && direction < 0)
			{
				LCD_UpdateQuery.SystemMenuRedraw = true;
				return;
			}
			Minutes = (uint8_t)(Minutes + direction);
		}
		if (TimeMenuSelection == 2)
		{
			if (Seconds == 0 && direction < 0)
				return;
			Seconds = (uint8_t)(Seconds + direction);
		}
		if (Hours >= 24)
			Hours = 0;
		if (Minutes >= 60)
			Minutes = 0;
		if (Seconds >= 60)
			Seconds = 0;
		RTC_TimeTypeDef sTime;
		sTime.TimeFormat = RTC_HOURFORMAT12_PM;
		sTime.SubSeconds = 0;
		sTime.SecondFraction = 0;
		sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
		sTime.StoreOperation = RTC_STOREOPERATION_SET;
		sTime.Hours = Hours;
		sTime.Minutes = Minutes;
		sTime.Seconds = Seconds;
		BKPSRAM_Enable();
		HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
	if (direction == 0)
	{
		sprintf(ctmp, "%d", Hours);
		addSymbols(ctmp, ctmp, 2, "0", false);
		LCDDriver_printText(ctmp, 76, 100, COLOR->BUTTON_TEXT, TimeMenuSelection == 0 ? FG_COLOR : BG_COLOR, LAYOUT->SYSMENU_FONT_SIZE);
		LCDDriver_printText(":", 124, 100, COLOR->BUTTON_TEXT, BG_COLOR, 3);
		sprintf(ctmp, "%d", Minutes);
		addSymbols(ctmp, ctmp, 2, "0", false);
		LCDDriver_printText(ctmp, 148, 100, COLOR->BUTTON_TEXT, TimeMenuSelection == 1 ? FG_COLOR : BG_COLOR, LAYOUT->SYSMENU_FONT_SIZE);
		LCDDriver_printText(":", 194, 100, COLOR->BUTTON_TEXT, BG_COLOR, 3);
		sprintf(ctmp, "%d", Seconds);
		addSymbols(ctmp, ctmp, 2, "0", false);
		LCDDriver_printText(ctmp, 220, 100, COLOR->BUTTON_TEXT, TimeMenuSelection == 2 ? FG_COLOR : BG_COLOR, LAYOUT->SYSMENU_FONT_SIZE);
	}
}

//FLASH MENU

static void SYSMENU_HANDL_Bootloader(int8_t direction)
{
#pragma unused(direction)
	WM8731_CleanBuffer();
	TRX.NeedGoToBootloader = true;
	SaveSettings();
	HAL_Delay(500);
	SCB->AIRCR = 0x05FA0004;
	
	TRX_Inited = false;
	LCD_busy = true;
}

static void SYSMENU_HANDL_OTA_Update(int8_t direction)
{
	FILEMANAGER_OTAUpdate_reset();
	FILEMANAGER_OTAUpdate_handler();
}

//SYSTEM INFO
static void SYSMENU_HANDL_SYSINFO(int8_t direction)
{
	sysmenu_infowindow_opened = true;
	sysmenu_sysinfo_opened = true;
	if (direction != 0)
		LCDDriver_Fill(BG_COLOR);
#define y_offs 20
	uint16_t y = 10;
	char out[80];
	sprintf(out, "STM32 FW ver: %s", version_string);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, LAYOUT->SYSMENU_FONT_SIZE);
	y += y_offs;
	sprintf(out, "FPGA FW ver: %d.%d.%d", FPGA_FW_Version[2], FPGA_FW_Version[1], FPGA_FW_Version[0]);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, LAYOUT->SYSMENU_FONT_SIZE);
	y += y_offs;
	sprintf(out, "WIFI IP: %s", WIFI_IP);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, LAYOUT->SYSMENU_FONT_SIZE);
	y += y_offs;
	sprintf(out, "FPGA SAMPLES: %d     ", dbg_FPGA_samples);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, LAYOUT->SYSMENU_FONT_SIZE);
	y += y_offs;
	sprintf(out, "STM32 VOLTAGE: %f     ", TRX_STM32_VREF);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, LAYOUT->SYSMENU_FONT_SIZE);
	y += y_offs;
	sprintf(out, "IQ PHASE: %f     ", TRX_IQ_phase_error);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, LAYOUT->SYSMENU_FONT_SIZE);
	y += y_offs;
	sprintf(out, "ADC MIN/MAX: %d/%d     ", TRX_ADC_MINAMPLITUDE, TRX_ADC_MAXAMPLITUDE);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, LAYOUT->SYSMENU_FONT_SIZE);
	y += y_offs;
	sprintf(out, "VCXO ERROR: %d     ", TRX_VCXO_ERROR);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, LAYOUT->SYSMENU_FONT_SIZE);
	y += y_offs;

	LCD_UpdateQuery.SystemMenu = true;
}

//CALIBRATION MENU

static void SYSMENU_HANDL_CALIB_ENCODER_INVERT(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.ENCODER_INVERT = true;
	if (direction < 0)
		CALIBRATE.ENCODER_INVERT = false;
}

static void SYSMENU_HANDL_CALIB_ENCODER2_INVERT(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.ENCODER2_INVERT = true;
	if (direction < 0)
		CALIBRATE.ENCODER2_INVERT = false;
}

