witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_CALIB_ENCODER_DEBOUNCE(int8_t direction)
{
	if (CALIBRATE.ENCODER_DEBOUNCE > 0 || direction > 0)
		CALIBRATE.ENCODER_DEBOUNCE += direction;
	if (CALIBRATE.ENCODER_DEBOUNCE > 250)
		CALIBRATE.ENCODER_DEBOUNCE = 250;
}

static void SYSMENU_HANDL_CALIB_ENCODER2_DEBOUNCE(int8_t direction)
{
	if (CALIBRATE.ENCODER2_DEBOUNCE > 0 || direction > 0)
		CALIBRATE.ENCODER2_DEBOUNCE += direction;
	if (CALIBRATE.ENCODER2_DEBOUNCE > 250)
		CALIBRATE.ENCODER2_DEBOUNCE = 250;
}

static void SYSMENU_HANDL_CALIB_ENCODER_SLOW_RATE(int8_t direction)
{
	CALIBRATE.ENCODER_SLOW_RATE += direction;
	if (CALIBRATE.ENCODER_SLOW_RATE < 1)
		CALIBRATE.ENCODER_SLOW_RATE = 1;
	if (CALIBRATE.ENCODER_SLOW_RATE > 100)
		CALIBRATE.ENCODER_SLOW_RATE = 100;
}

static void SYSMENU_HANDL_CALIB_ENCODER_ON_FALLING(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.ENCODER_ON_FALLING = true;
	if (direction < 0)
		CALIBRATE.ENCODER_ON_FALLING = false;
}

static void SYSMENU_HANDL_CALIB_ENCODER_ACCELERATION(int8_t direction)
{
	CALIBRATE.ENCODER_ACCELERATION += direction;
	if (CALIBRATE.ENCODER_ACCELERATION < 1)
		CALIBRATE.ENCODER_ACCELERATION = 1;
	if (CALIBRATE.ENCODER_ACCELERATION > 250)
		CALIBRATE.ENCODER_ACCELERATION = 250;
}

static void SYSMENU_HANDL_CALIB_RF_unit_type(int8_t direction)
{
	if(CALIBRATE.RF_unit_type > 0 || direction > 0)
		CALIBRATE.RF_unit_type += direction;
	if (CALIBRATE.RF_unit_type > 1)
		CALIBRATE.RF_unit_type = 1;
	
	if(CALIBRATE.RF_unit_type == RF_UNIT_QRP)
	{
		CALIBRATE.rf_out_power_2200m = 29;		   //2200m
		CALIBRATE.rf_out_power_160m = 29;		   //160m
		CALIBRATE.rf_out_power_80m = 27;		   //80m
		CALIBRATE.rf_out_power_40m = 26;		   //40m
		CALIBRATE.rf_out_power_30m = 26;		   //30m
		CALIBRATE.rf_out_power_20m = 24;		   //20m
		CALIBRATE.rf_out_power_17m = 24;		   //17m
		CALIBRATE.rf_out_power_15m = 24;		   //15m
		CALIBRATE.rf_out_power_12m = 24;		   //12m
		CALIBRATE.rf_out_power_cb = 24;				//27mhz
		CALIBRATE.rf_out_power_10m = 24;		   //10m
		CALIBRATE.rf_out_power_6m = 13;			   //6m
		CALIBRATE.rf_out_power_2m = 300;		   //2m
		CALIBRATE.RFU_LPF_END = 60000 * 1000;		   //LPF
		CALIBRATE.RFU_HPF_START = 60000 * 1000;		   //HPF U14-RF1
		CALIBRATE.RFU_BPF_0_START = 135 * 1000 * 1000; //2m U14-RF3
		CALIBRATE.RFU_BPF_0_END = 150 * 1000 * 1000;   //2m
		CALIBRATE.RFU_BPF_1_START = 1500 * 1000;	   //160m U16-RF2
		CALIBRATE.RFU_BPF_1_END = 2400 * 1000;		   //160m
		CALIBRATE.RFU_BPF_2_START = 2400 * 1000;	   //80m U16-RF4
		CALIBRATE.RFU_BPF_2_END = 4700 * 1000;		   //80m
		CALIBRATE.RFU_BPF_3_START = 4700 * 1000;	   //40m U16-RF1
		CALIBRATE.RFU_BPF_3_END = 7200 * 1000;		   //40m
		CALIBRATE.RFU_BPF_4_START = 7200 * 1000;	   //30m U16-RF3
		CALIBRATE.RFU_BPF_4_END = 11500 * 1000;		   //30m
		CALIBRATE.RFU_BPF_5_START = 11500 * 1000;	   //20,17m U14-RF2
		CALIBRATE.RFU_BPF_5_END = 21000 * 1000;		   //20,17m
		CALIBRATE.RFU_BPF_6_START = 21000 * 1000;	   //15,12,10,6m U14-RF4
		CALIBRATE.RFU_BPF_6_END = 64000 * 1000;		   //15,12,10,6m
		CALIBRATE.RFU_BPF_7_START = 0;	   //disabled on qrp version
		CALIBRATE.RFU_BPF_7_END = 0;		   //disabled on qrp version
		CALIBRATE.RFU_BPF_8_START = 0;	   //disabled on qrp version
		CALIBRATE.RFU_BPF_8_END = 0;		   //disabled on qrp version
		CALIBRATE.RFU_BPF_9_START = 0;	   //disabled on qrp version
		CALIBRATE.RFU_BPF_9_END = 0;		   //disabled on qrp version
		CALIBRATE.SWR_FWD_Calibration_HF = 11.0f;	   //SWR Transormator rate forward
		CALIBRATE.SWR_REF_Calibration_HF = 11.0f;	   //SWR Transormator rate return
		CALIBRATE.SWR_FWD_Calibration_6M = 10.0f;	   //SWR Transormator rate forward
		CALIBRATE.SWR_REF_Calibration_6M = 10.0f;	   //SWR Transormator rate return
		CALIBRATE.SWR_FWD_Calibration_VHF = 3.6f;	   //SWR Transormator rate forward
		CALIBRATE.SWR_REF_Calibration_VHF = 3.6f;	   //SWR Transormator rate return
		CALIBRATE.TUNE_MAX_POWER = 2;			   // Maximum RF power in Tune mode
		CALIBRATE.MAX_RF_POWER = 7;				//Max TRX Power for indication
	}
	if(CALIBRATE.RF_unit_type == RF_UNIT_BIG)
	{
		CALIBRATE.rf_out_power_2200m = 40;		   //2200m
		CALIBRATE.rf_out_power_160m = 40;		   //160m
		CALIBRATE.rf_out_power_80m = 40;		   //80m
		CALIBRATE.rf_out_power_40m = 40;		   //40m
		CALIBRATE.rf_out_power_30m = 40;		   //30m
		CALIBRATE.rf_out_power_20m = 40;		   //20m
		CALIBRATE.rf_out_power_17m = 40;		   //17m
		CALIBRATE.rf_out_power_15m = 40;		   //15m
		CALIBRATE.rf_out_power_12m = 40;		   //12m
		CALIBRATE.rf_out_power_cb = 40;				//27mhz
		CALIBRATE.rf_out_power_10m = 40;		   //10m
		CALIBRATE.rf_out_power_6m = 40;			   //6m
		CALIBRATE.rf_out_power_2m = 50;		   //2m
		CALIBRATE.RFU_LPF_END = 0;		   //disabled in BIG version
		CALIBRATE.RFU_HPF_START = 0;		   //disabled in BIG version
		CALIBRATE.RFU_BPF_1_START = 0 * 1000;	   //2200m
		CALIBRATE.RFU_BPF_1_END = 1000 * 1000;		   //2200m
		CALIBRATE.RFU_BPF_2_START = 1000 * 1000;	   //160m
		CALIBRATE.RFU_BPF_2_END = 2500 * 1000;		   //160m
		CALIBRATE.RFU_BPF_3_START = 2500 * 1000;	   //80m
		CALIBRATE.RFU_BPF_3_END = 5000 * 1000;		   //80m
		CALIBRATE.RFU_BPF_4_START = 5000 * 1000;	   //40m
		CALIBRATE.RFU_BPF_4_END = 8500 * 1000;		   //40m
		CALIBRATE.RFU_BPF_5_START = 8500 * 1000;	   //30m
		CALIBRATE.RFU_BPF_5_END = 12000 * 1000;		   //30m
		CALIBRATE.RFU_BPF_6_START = 12000 * 1000;	   //20m
		CALIBRATE.RFU_BPF_6_END = 17000 * 1000;		   //20m
		CALIBRATE.RFU_BPF_7_START = 17000 * 1000;	   //17,15,12m
		CALIBRATE.RFU_BPF_7_END = 25500 * 1000;		   //17,15,12m
		CALIBRATE.RFU_BPF_8_START = 25500 * 1000;	   //CB,10m
		CALIBRATE.RFU_BPF_8_END = 35000 * 1000;		   //CB,10m
		CALIBRATE.RFU_BPF_9_START = 35000 * 1000;	   //6m
		CALIBRATE.RFU_BPF_9_END = 70000 * 1000;		   //6m
		CALIBRATE.SWR_FWD_Calibration_HF = 22.0f;	   //SWR Transormator rate forward
		CALIBRATE.SWR_REF_Calibration_HF = 22.0f;	   //SWR Transormator rate return
		CALIBRATE.SWR_FWD_Calibration_6M = 22.0f;	   //SWR Transormator rate forward
		CALIBRATE.SWR_REF_Calibration_6M = 22.0f;	   //SWR Transormator rate return
		CALIBRATE.SWR_FWD_Calibration_VHF = 22.0f;	   //SWR Transormator rate forward
		CALIBRATE.SWR_REF_Calibration_VHF = 22.0f;	   //SWR Transormator rate return
		CALIBRATE.TUNE_MAX_POWER = 10;			   // Maximum RF power in Tune mode
		CALIBRATE.MAX_RF_POWER = 50;				//Max TRX Power for indication
	}
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_CALIB_TangentType(int8_t direction)
{
	if(CALIBRATE.TangentType > 0 || direction > 0)
		CALIBRATE.TangentType += direction;
	if (CALIBRATE.TangentType > 1)
		CALIBRATE.TangentType = 1;
}

static void SYSMENU_HANDL_CALIBRATIONMENU(int8_t direction)
{
#pragma unused(direction)
	if (!SYSMENU_hiddenmenu_enabled)
		return;
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_calibration_handlers[0];
	sysmenu_item_count = sizeof(sysmenu_calibration_handlers) / sizeof(sysmenu_calibration_handlers[0]);
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_SWR_Tandem_Ctrl(int8_t direction) //Tisho
{
#pragma unused(direction)
	if (SYSMENU_TDM_CTRL_opened)
	{
	}
	else
	{
		SYSMENU_TDM_CTRL_opened = true;
		TDM_Voltages_Start();
		//		drawSystemMenu(true);
	}
}

