witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_CALIB_RTC_CALIBRATION(int8_t direction)
{
	CALIBRATE.RTC_Calibration += direction;
	if (CALIBRATE.RTC_Calibration < -511)
		CALIBRATE.RTC_Calibration = -511;
	if (CALIBRATE.RTC_Calibration > 511)
		CALIBRATE.RTC_Calibration = 511;

	RTC_Calibration();
}

static void SYSMENU_HANDL_CALIB_RTC_COARSE_CALIBRATION(int8_t direction)
{
	CALIBRATE.RTC_Coarse_Calibration += direction;
	if (CALIBRATE.RTC_Coarse_Calibration < 1)
		CALIBRATE.RTC_Coarse_Calibration = 1;
	if (CALIBRATE.RTC_Coarse_Calibration > 250)
		CALIBRATE.RTC_Coarse_Calibration = 250;

	RTC_Calibration();
}

static void SYSMENU_HANDL_CALIB_EXT_2200m(int8_t direction)
{
	if(CALIBRATE.EXT_2200m > 0 || direction > 0)
		CALIBRATE.EXT_2200m += direction;
	if (CALIBRATE.EXT_2200m > 15)
		CALIBRATE.EXT_2200m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_160m(int8_t direction)
{
	if(CALIBRATE.EXT_160m > 0 || direction > 0)
		CALIBRATE.EXT_160m += direction;
	if (CALIBRATE.EXT_160m > 15)
		CALIBRATE.EXT_160m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_80m(int8_t direction)
{
	if(CALIBRATE.EXT_80m > 0 || direction > 0)
		CALIBRATE.EXT_80m += direction;
	if (CALIBRATE.EXT_80m > 15)
		CALIBRATE.EXT_80m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_60m(int8_t direction)
{
	if(CALIBRATE.EXT_60m > 0 || direction > 0)
		CALIBRATE.EXT_60m += direction;
	if (CALIBRATE.EXT_60m > 15)
		CALIBRATE.EXT_60m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_40m(int8_t direction)
{
	if(CALIBRATE.EXT_40m > 0 || direction > 0)
		CALIBRATE.EXT_40m += direction;
	if (CALIBRATE.EXT_40m > 15)
		CALIBRATE.EXT_40m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_30m(int8_t direction)
{
	if(CALIBRATE.EXT_30m > 0 || direction > 0)
		CALIBRATE.EXT_30m += direction;
	if (CALIBRATE.EXT_30m > 15)
		CALIBRATE.EXT_30m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_20m(int8_t direction)
{
	if(CALIBRATE.EXT_20m > 0 || direction > 0)
		CALIBRATE.EXT_20m += direction;
	if (CALIBRATE.EXT_20m > 15)
		CALIBRATE.EXT_20m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_17m(int8_t direction)
{
	if(CALIBRATE.EXT_17m > 0 || direction > 0)
		CALIBRATE.EXT_17m += direction;
	if (CALIBRATE.EXT_17m > 15)
		CALIBRATE.EXT_17m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_15m(int8_t direction)
{
	if(CALIBRATE.EXT_15m > 0 || direction > 0)
		CALIBRATE.EXT_15m += direction;
	if (CALIBRATE.EXT_15m > 15)
		CALIBRATE.EXT_15m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_12m(int8_t direction)
{
	if(CALIBRATE.EXT_12m > 0 || direction > 0)
		CALIBRATE.EXT_12m += direction;
	if (CALIBRATE.EXT_12m > 15)
		CALIBRATE.EXT_12m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_CB(int8_t direction)
{
	if(CALIBRATE.EXT_CB > 0 || direction > 0)
		CALIBRATE.EXT_CB += direction;
	if (CALIBRATE.EXT_CB > 15)
		CALIBRATE.EXT_CB = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_10m(int8_t direction)
{
	if(CALIBRATE.EXT_10m > 0 || direction > 0)
		CALIBRATE.EXT_10m += direction;
	if (CALIBRATE.EXT_10m > 15)
		CALIBRATE.EXT_10m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_6m(int8_t direction)
{
	if(CALIBRATE.EXT_6m > 0 || direction > 0)
		CALIBRATE.EXT_6m += direction;
	if (CALIBRATE.EXT_6m > 15)
		CALIBRATE.EXT_6m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_FM(int8_t direction)
{
	if(CALIBRATE.EXT_FM > 0 || direction > 0)
		CALIBRATE.EXT_FM += direction;
	if (CALIBRATE.EXT_FM > 15)
		CALIBRATE.EXT_FM = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_2m(int8_t direction)
{
	if(CALIBRATE.EXT_2m > 0 || direction > 0)
		CALIBRATE.EXT_2m += direction;
	if (CALIBRATE.EXT_2m > 15)
		CALIBRATE.EXT_2m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_70cm(int8_t direction)
{
	if(CALIBRATE.EXT_70cm > 0 || direction > 0)
		CALIBRATE.EXT_70cm += direction;
	if (CALIBRATE.EXT_70cm > 15)
		CALIBRATE.EXT_70cm = 15;
}

static void SYSMENU_HANDL_CALIB_NOTX_NOTHAM(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_NOTHAM = true;
	if (direction < 0)
		CALIBRATE.NOTX_NOTHAM = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_2200m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_2200m = true;
	if (direction < 0)
		CALIBRATE.NOTX_2200m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_160m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_160m = true;
	if (direction < 0)
		CALIBRATE.NOTX_160m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_80m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_80m = true;
	if (direction < 0)
		CALIBRATE.NOTX_80m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_60m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_60m = true;
	if (direction < 0)
		CALIBRATE.NOTX_60m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_40m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_40m = true;
	if (direction < 0)
		CALIBRATE.NOTX_40m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_30m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_30m = true;
	if (direction < 0)
		CALIBRATE.NOTX_30m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_20m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_20m = true;
	if (direction < 0)
		CALIBRATE.NOTX_20m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_17m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_17m = true;
	if (direction < 0)
		CALIBRATE.NOTX_17m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_15m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_15m = true;
	if (direction < 0)
		CALIBRATE.NOTX_15m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_12m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_12m = true;
	if (direction < 0)
		CALIBRATE.NOTX_12m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_CB(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_CB = true;
	if (direction < 0)
		CALIBRATE.NOTX_CB = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_10m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_10m = true;
	if (direction < 0)
		CALIBRATE.NOTX_10m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_6m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_6m = true;
	if (direction < 0)
		CALIBRATE.NOTX_6m = false;
}

